#Придумати власні приклади на альтернативні варіанти if і активне використання булевої алгебри.

import math
print("З'ясуйте чи існують корені рівняння  ax^2+bx+c=0", '\n\n')
a1 = float(input('Введіть значення a'))
a2 = float(input('Введіть значення b'))
a3 = float(input('Введіть значення c'))
d = a2*a2 - 4*a1*a3
if d < 0:
    print("Немає коренів")
elif d == 0:
    x = -a2 / (2 * a1)
    print("Один корінь", x)
else:
    d > 0
    x1=(-a2 + math.sqrt(d)/(2*a1))
    x2=(-a2 - math.sqrt(d)/(2*a1))
    print("Два кореня", 'x1=', x1, 'x2=', x2)
